<!-- placeholder-1 -->
```fish
terraform plan -chdir=. -var-file=/home/runner/work/testpr-infra/testpr-infra/env/testpr_test_uksouth/testpr_test_uksouth.tfvars
```
<!-- placeholder-2 -->

<!-- placeholder-3 -->
<details><summary>Plan: 5 to add, 0 to change, 0 to destroy.</br>

<!-- placeholder-4 -->
###### By @mattv1vhm at 2025-08-22T20:33:48Z [(view log)](https://github.com/v1vhm/testpr-infra/actions/runs/17165389597/job/48704536884#step:6:1).
</summary>

```hcl

Error: resources.GroupsClient#Get: Failure responding to request: StatusCode=403 -- Original Error: autorest/azure: Service returned an error. Status=403 Code="AuthorizationFailed" Message="The client 'b1254747-e0e7-4387-bd9b-39a2e6085149' with object id 'b1254747-e0e7-4387-bd9b-39a2e6085149' does not have authorization to perform action 'Microsoft.Resources/subscriptions/resourcegroups/read' over scope '/subscriptions/da7f852b-9a37-4283-a8c0-de1dafd6cb1f/resourcegroups/rg-TESTPR-dev-uksouth' or the scope is invalid. If access was recently granted, please refresh your credentials."

  with data.azurerm_resource_group.this,
  on main.tf line 4, in data "azurerm_resource_group" "this":
   4: data "azurerm_resource_group" "this" {

m-ptn-aiml-ai-foundry.data.azapi_client_config.telemetry[0]: Read complete after 1s [id=clientConfigs/subscriptionId=da7f852b-9a37-4283-a8c0-de1dafd6cb1f;tenantId=b81eb8a4-9a3e-4054-a89f-882e0eae1c3d]
module.avm-ptn-aiml-ai-foundry.module.avm_utl_regions.data.azapi_client_config.current: Read complete after 1s [id=clientConfigs/subscriptionId=da7f852b-9a37-4283-a8c0-de1dafd6cb1f;tenantId=b81eb8a4-9a3e-4054-a89f-882e0eae1c3d]
module.avm-ptn-aiml-ai-foundry.module.avm_utl_regions.data.azapi_client_config.telemetry[0]: Read complete after 1s [id=clientConfigs/subscriptionId=da7f852b-9a37-4283-a8c0-de1dafd6cb1f;tenantId=b81eb8a4-9a3e-4054-a89f-882e0eae1c3d]
data.azurerm_resource_group.this: Reading...
data.azurerm_resource_group.deployment-rg: Reading...
module.avm-ptn-aiml-ai-foundry.data.azurerm_client_config.current: Reading...
module.avm-ptn-aiml-ai-foundry.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD0yYjVlMmY5Zi03MTNmLTQwM2ItOWRlNC1jOWI4ZTY2YTMyMTk7b2JqZWN0SWQ9YjEyNTQ3NDctZTBlNy00Mzg3LWJkOWItMzlhMmU2MDg1MTQ5O3N1YnNjcmlwdGlvbklkPWRhN2Y4NTJiLTlhMzctNDI4My1hOGMwLWRlMWRhZmQ2Y2IxZjt0ZW5hbnRJZD1iODFlYjhhNC05YTNlLTQwNTQtYTg5Zi04ODJlMGVhZTFjM2Q=]
data.azurerm_resource_group.deployment-rg: Read complete after 0s [id=/subscriptions/da7f852b-9a37-4283-a8c0-de1dafd6cb1f/resourceGroups/rg-TESTPR-test-uksouth]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform planned the following actions, but then encountered a problem:

  # module.avm-ptn-aiml-ai-foundry.modtm_telemetry.telemetry[0] will be created
  + resource "modtm_telemetry" "telemetry" {
      + ephemeral_number = (known after apply)
      + id               = (known after apply)
      + nonce            = (known after apply)
      + tags             = {
          + "location"        = "uksouth"
          + "module_source"   = "registry.terraform.io/Azure/avm-ptn-aiml-ai-foundry/azurerm"
          + "module_version"  = "0.6.0"
          + "random_id"       = (known after apply)
          + "subscription_id" = "da7f852b-9a37-4283-a8c0-de1dafd6cb1f"
          + "tenant_id"       = "b81eb8a4-9a3e-4054-a89f-882e0eae1c3d"
        }
    }

  # module.avm-ptn-aiml-ai-foundry.random_string.resource_token will be created
  + resource "random_string" "resource_token" {
      + id          = (known after apply)
      + length      = 5
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

  # module.avm-ptn-aiml-ai-foundry.random_uuid.telemetry[0] will be created
  + resource "random_uuid" "telemetry" {
      + id     = (known after apply)
      + result = (known after apply)
    }

  # module.avm-ptn-aiml-ai-foundry.module.avm_utl_regions.modtm_telemetry.telemetry[0] will be created
  + resource "modtm_telemetry" "telemetry" {
      + ephemeral_number = (known after apply)
      + id               = (known after apply)
      + nonce            = (known after apply)
      + tags             = {
          + "module_source"   = "registry.terraform.io/Azure/avm-utl-regions/azurerm"
          + "module_version"  = "0.5.2"
          + "random_id"       = (known after apply)
          + "subscription_id" = "da7f852b-9a37-4283-a8c0-de1dafd6cb1f"
          + "tenant_id"       = "b81eb8a4-9a3e-4054-a89f-882e0eae1c3d"
        }
    }

  # module.avm-ptn-aiml-ai-foundry.module.avm_utl_regions.random_uuid.telemetry[0] will be created
  + resource "random_uuid" "telemetry" {
      + id     = (known after apply)
      + result = (known after apply)
    }

Plan: 5 to add, 0 to change, 0 to destroy.
Releasing state lock. This may take a few moments...
```
</details>
<!-- placeholder-5 -->
<!-- terraform-26-3a8610adc618341e347e2681800303bf.tfplan -->
<!-- placeholder-6 -->